/*
2. Рассматриваются все числа от 1 до n.
Сколько раз встречается каждая цифра от 0 до 9 во всех этих числах вместе взятых?
*/
#include <iostream>
using namespace std;
int main() {
    setlocale(LC_ALL, "Russian");
    int n,a,ch,k0,k1,k2,k3,k4,k5,k6,k7,k8,k9;
    cout<<"Введит количество чисел: ";
    cin>>n;
    k0=k1=k2=k3=k4=k5=k6=k7=k8=k9=0;
    for (int v=0; v<n; v++) {
        cout<<"Введите число: ";
        cin>>a;
        while (a > 0) {
            ch = a % 10;
            if (ch == 0) {
                k0 += 1;
            }
            if (ch == 1) {
                k1 += 1;
            }
            if (ch == 2) {
                k2 += 1;
            }
            if (ch == 3) {
                k3 += 1;
            }
            if (ch == 4) {
                k4 += 1;
            }
            if (ch == 5) {
                k5 += 1;
            }
            if (ch == 6) {
                k6 += 1;
            }
            if (ch == 7) {
                k7 += 1;
            }
            if (ch == 8) {
                k8 += 1;
            }
            if (ch == 9) {
                k9 += 1;
            }
            a = a / 10;
        }
    }
    cout<<endl;
    cout<<"Чисел \"0\": "<<k0<<" штук!"<<endl;
    cout<<"Чисел \"1\": "<<k1<<" штук!"<<endl;
    cout<<"Чисел \"2\": "<<k2<<" штук!"<<endl;
    cout<<"Чисел \"3\": "<<k3<<" штук!"<<endl;
    cout<<"Чисел \"4\": "<<k4<<" штук!"<<endl;
    cout<<"Чисел \"5\": "<<k5<<" штук!"<<endl;
    cout<<"Чисел \"6\": "<<k6<<" штук!"<<endl;
    cout<<"Чисел \"7\": "<<k7<<" штук!"<<endl;
    cout<<"Чисел \"8\": "<<k8<<" штук!"<<endl;
    cout<<"Чисел \"9\": "<<k9<<" штук!"<<endl;


    return 0;
}

// ПРИНЯЛИ 02.11.2021 16:05